day14_homework/app/controllers/patients_controller.rb

  def show
    @medications = Medication.all
---
SELECT `medications`.* FROM `medications`  WHERE `medications`.`patient_id` = 9

  def create
    @patient = @hospital.patients.new(patient_params)

    if @patient.save == true
---
INSERT INTO `patients` (`created_at`, `date_of_birth`, `first_name`, `gender`, `hospital_id`, `last_name`, `malady`, `updated_at`, `workflow_state`) VALUES ('2014-08-11 20:01:29', '2014-08-11', 'mike', 'Male', 3, 'dion', 'cold', '2014-08-11 20:01:29', 'waiting')

  def edit
    @patient = Patient.find params[:id]
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1

  def update
    @patient = Patient.find params[:id]
    if @patient.update_attributes patient_params
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1
UPDATE `patients` SET `date_of_birth` = '', `gender` = '', `last_name` = 'rice', `malady` = 'hair is just to curly', `updated_at` = '2014-08-08 19:32:34' WHERE `patients`.`id` = 1

  def destroy
    @patients = Patient.find params[:id]
    @patients.delete
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 2

  def find_patient
    @patient = Patient.find(params[:id])
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1

  def find_hospital
    @hospital = Hospital.find(params[:hospital_id])
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = '--- !ruby/hash:ActionController::Parameters\nutf8: \"✓\"\nauthenticity_token: fiH89UEUojvoy0uQUO4b5P98DOTUy8ecd112Vqxb72k=\npatient: !ruby/hash:ActiveSupport::HashWithIndifferentAccess\n  first_name: supernick\n  last_name: b\n  malady: vitamin b high\n  workflow_state: waiting\n  gender: Male\n  date_of_birth(1i): \'1988\'\n  date_of_birth(2i): \'8\'\n  date_of_birth(3i): \'11\'\n  hospital_id: \'2\'\ncommit: Save patient record\naction: create\ncontroller: patients\n' LIMIT 1