rails_workflow&validations_homework/app/controllers/patients_controller.rb

  def create
    @patient = Patient.create patient_params
---
INSERT INTO `patients` (`created_at`, `date_of_birth`, `first_name`, `gender`, `last_name`, `malady`, `updated_at`, `workflow_state`) VALUES ('2014-08-10 17:55:32', '1987-10-16', 'chris', 'Male', 'lovette', 'love sick', '2014-08-10 17:55:32', 'waiting')

  def update
    if @patient.update_attributes patient_params
---
UPDATE `patients` SET `date_of_birth` = '', `gender` = '', `last_name` = 'rice', `malady` = 'hair is just to curly', `updated_at` = '2014-08-08 19:32:34' WHERE `patients`.`id` = 1

  def destroy
    @patients = Patient.find params[:id]
    @patients.delete
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 2

  def find_patient
    @patient = Patient.find(params[:id])
---
SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1