day11_homework/app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients`
---
  def index
    @patients = Patient.all

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1
---
  def show
     @patient = Patient.find params[:id]

INSERT INTO `patients` (`created_at`, `first_name`, `malady`, `updated_at`) VALUES ('2014-08-08 18:37:59', 'rob', 'to much hair', '2014-08-08 18:37:59')
---
  def create
    Patient.create patient_params

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
---
  def edit
    @patient = Patient.find params[:id]

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 1 LIMIT 1
UPDATE `patients` SET `date_of_birth` = '', `gender` = '', `last_name` = 'rice', `malady` = 'hair is just to curly', `updated_at` = '2014-08-08 19:32:34' WHERE `patients`.`id` = 1
---
  def update
    @patient = Patient.find params[:id]
    @patient.update_attributes patient_params

SELECT  `patients`.* FROM `patients`  WHERE `patients`.`id` = 2 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 2
---
  def destroy
    @patients = Patient.find params[:id]
    @patients.delete