day14_homework/app/views/patients/show.html.erb

SELECT `medications`.* FROM `medications`  WHERE `medications`.`patient_id` = 9
---
    <label>Medications:</label>
      <% @patient.medications.each do |x| %>