day16_homework/app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT `hospitals`.* FROM `hospitals`

  def show
    @hospital = Hospital.find params[:id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1

  def create
    @hospitals = Hospital.create hospital_params
---
INSERT INTO `hospitals` (`beds`, `created_at`, `location`, `name`, `updated_at`) VALUES (5, '2014-08-12 15:53:38', 'ironbar', 'bigwinfootball', '2014-08-12 15:53:38')

  def edit
   @hospital = Hospital.find params[:id]
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 6 LIMIT 1

  def update
    @hospital = Hospital.find params[:id]
    @hospital.update_attributes hospital_params
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 6 LIMIT 1
UPDATE `hospitals` SET `beds` = 16, `updated_at` = '2014-08-12 16:02:45' WHERE `hospitals`.`id` = 6

  def destroy
    @hospital = Hospital.find params[:id]
    @hospital.delete
---
SELECT  `hospitals`.* FROM `hospitals`  WHERE `hospitals`.`id` = 1 LIMIT 1
DELETE FROM `hospitals` WHERE `hospitals`.`id` = 1